app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" ORDER BY start_date ASC

  def show
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY start_date ASC LIMIT 1  [["id", "10"]]

  def edit
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY start_date ASC LIMIT 1  [["id", "10"]]

  def create
    @event = Event.new(params[:event])

    #@event.startdate = DateTime.new(params["startdate(1i)"].to_i, params["startdate(2i)"].to_i, params["startdate(3i)"].to_i, params["startdate(4i)"].to_i, params["startdate(5i)"].to_i)

    #@event.startdate = Datetime.strptime("#{params['startdate(3i)']}/#{params['startdate(2i)']}/#{params['startdate(1i)']}", "%d/%m/%y")
    #@event.enddate = Datetime.strptime("#{params['enddate(3i)']}/#{params['enddate(2i)']}/#{params['enddate(1i)']}", "%d/%m/%y")

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "end_date", "location", "notes", "start_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", 2017-12-24 20:53:03 UTC], ["start_date", nil], ["location", nil], ["notes", nil], ["start_date", nil], ["title", nil], ["updated_at", 2017-12-24 20:53:03 UTC]]

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY start_date ASC LIMIT 1  [["id", "1"]]
UPDATE "events" SET "title" = 'January 28nd: 12:00 PM', "start_date" = '2018-01-28 17:00:00.000000', "end_date" = '2018-01-28 17:30:00.000000', "updated_at" = '2018-01-28 16:54:42.855943' WHERE "events"."id" = 6